hw-acceptance-unit-test-cycle/rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "params[:director]"]]
---
  def same_director
    @movie= Movie.find_by director: params[:director]